{"status":"success","totalResults":1,"results":[{"title":"Rogoh Rp124 Miliar, GOTO Masuk Bisnis Kripto","link":"https://ekbis.sindonews.com/read/870125/178/rogoh-rp124-miliar-goto-masuk-bisnis-kripto-1661774893","keywords":null,"creator":["Dinar Fitra Maghiszha"],"video_url":null,"description":"PT GoTo Gojek Tokopedia Tbk melalui anak usahanya, PT Dompet Karya Anak Bangsa, mengumumkan akuisisi perusahaan yang bergerak di perdagangan aset kripto.","content":"JAKARTA - PT GoTo Gojek Tokopedia Tbk ( GOTO ) melalui anak usahanya, PT Dompet Karya Anak Bangsa (DKAB) atau GoPay, mengumumkan akuisisi perusahaan yang bergerak dalam bidang perdagangan aset kripto , PT Kripto Maksima Koin (KMK). Baca juga: BEI Beberkan Kronologi Investasi Telkomsel di GOTO Rp6,4 Triliun Sekretaris Perusahaan GOTO R A Koesoemohadiani mengatakan, DKAB telah melakukan pembelian 50.000 lembar saham KMK dengan nilai akuisisi sebesar Rp124,83 miliar pada 25 Agustus 2022. Secara rinci, DKAB memegang saham KMK sebesar 99,98%, sedangkan GOTO memiliki 0,02%. \"Tujuan transaksi adalah perluasan kegiatan usaha perseroan melalui anak usaha,\" kata Diani, sapaan akrabnya, dalam keterangan tertulis, Senin (29/8/2022). Saat dikonfirmasi, GOTO menyatakan akan melakukan inkubasi atau berinvestasi ke dalam teknologi baru, khususnya teknologi rantai blok atau blockchain yang dinilai dapat memiliki peran vital dalam bidang teknologi finansial (fintech). \"Pada saat ini kami belum memiliki rencana khusus, dari waktu ke waktu kami terus melakukan inkubasi atau berinvestasi pada teknologi baru, agar kami dapat memanfaatkan kesempatan yang ada pada waktu yang tepat, dengan selalu mematuhi peraturan yang berlaku,\" kata Head of Corporate Communications, GoTo Financial, Alina Darmadi, saat dihubungi MNC Portal Indonesia (MPI), Senin (29/8/2022). Alina meyakini akuisisi ini dapat membuat GoTo Financial mampu menjadi pemimpin sektor pengelolaan keuangan di Tanah Air. Menurutnya, sebagai bagian dari Grup GoTo, perusahaannya terus berupaya menjadi pusat pengelolaan keuangan yang dapat menjawab beragam kebutuhan masyarakat. \"Kami percaya blockchain akan berperan penting bagi masa depan teknologi finansial,\" tandasnya. Baca juga: 20 Bangkai Kapal Perang Nazi Muncul di Serbia, Berisi Banyak Amunisi Sebagai catatan, PT KMK merupakan salah satu perusahaan pedagang aset kripto yang terdaftar dalam Badan Pengawas Perdagangan Berjangka Komoditi (Bappebti), yang merupakan unsur pendukung Kementerian Perdagangan. KMK terdaftar dengan nomor 003/BAPPEBTI/CP-AK/01/2022 pada tanggal 28 Januari 2022. Lihat Juga: Pendekatan Binance untuk Penyempurnaan Keamanan Kripto (uka)","pubDate":"2022-08-29 12:46:57","image_url":"https://pict.sindonews.net/dyn/620/pena/news/2022/08/29/178/870125/rogoh-rp124-miliar-goto-masuk-bisnis-kripto-kvh.jpg","source_id":"sindonews","country":["indonesia"],"category":["top"],"language":"indonesian"}],"nextPage":null}
